Repository: torshinrg/learn_languages
Catalog: lib/l10n/app_*.arb
Languages: ru

# appTitle
source: Learn Languages
ru: Изучай Языки

# homeGreeting
source: Welcome, let’s start learning!
ru: Добро пожаловать, начнём учиться!

# studyButton
source: Start Study
ru: Начать обучение

# reviewButton
source: Review
ru: Повторение

source: 🔥 Streak:
ru: 🔥 Серия:

source: day
ru: день

source: days
ru: дней

# reviewsDue
source: {dueCount, plural, =0{You have no reviews due} one{You have 1 review due} other{You have {dueCount} reviews due}}
ru: {dueCount, plural, =0{У вас нет заданий для повторения} one{У вас 1 задание для повторения} few{У вас {dueCount} задания для повторения} many{У вас {dueCount} заданий для повторения} other{У вас {dueCount} заданий для повторения}}

source: Review
ru: Повторение

# today_session
source: Today's Session
ru: Сегодняшняя сессия

source: new words learned
ru: новых слов выучено

source: Start Study
ru: Начать обучение

source: Vocabulary
ru: Словарь

source: Stats
ru: Статистика

source: Settings
ru: Настройки

source: Add Custom Word
ru: Добавить своё слово

source: New word
ru: Новое слово

source: Added
ru: Добавлено

source: Reminder Settings
ru: Настройки напоминаний

source: Add Reminder
ru: Добавить напоминание

# reminderSet
source: Reminder set at {pickedTime}. Now: {now}. Fires next at {next}.
ru: Напоминание установлено на {pickedTime}. Сейчас: {now}. Следующее: {next}.

# reminderUpdated
source: Reminder updated to {pickedTime}.
ru: Напоминание обновлено на {pickedTime}.

# qualityAgain
source: Again
ru: Ещё раз

# qualityHard
source: Hard
ru: Сложно

# qualityGood
source: Good
ru: Хорошо

# qualityEasy
source: Easy
ru: Легко

source: Words per day
ru: Слов в день

source: Save
ru: Сохранить

source: Study Reminders
ru: Напоминания об обучении

source: per day
ru: в день

source: Custom Words
ru: Свои слова

source: Today Learned
ru: Выучено сегодня

source: Current Streak
ru: Текущая серия

source: Total Words
ru: Всего слов

source: Mastered Words
ru: Освоено слов

# no_words
source: No words to study.
ru: Нет слов для изучения.

source: Study
ru: Учить

source: Got it
ru: Понял

source: Skip word
ru: Пропустить слово

source: Learning Now
ru: Изучается сейчас

source: Pending
ru: Ожидает

source: Mastered
ru: Освоено

# excellent
source: 🎉 Excellent! You nailed it!
ru: 🎉 Отлично! Вы справились!

source: 👍 Great job!
ru: 👍 Отличная работа!

# good_work
source: 🙂 Good work, keep going!
ru: 🙂 Хорошая работа, так держать!

# try_again
source: 💪 Don’t give up, try again!
ru: 💪 Не сдавайтесь, попробуйте снова!

source: Tap to Speak Again
ru: Нажмите, чтобы повторить

source: Next Sentence
ru: Следующее предложение

source: Tap to Speak
ru: Нажмите, чтобы говорить

source: Recorded by
ru: Автор:

# licence
source: License:
ru: Лицензия:

# no_reviews
source: No reviews due right now.
ru: Пока нечего повторять!

# exercises_title
source: Bite-sized Tasks
ru: 🧠 Микроупражнения

# reviewProgress
source: Word {current} of {total}
ru: Слово {current} из {total}

# streakDead
source: 💀 Streak’s dead. Try again now!
ru: 💀 Серия окончена. Попробуй снова!

# streakZero
source: 🪔 Let's ignite your streak!
ru: 🪔 Зажжём твою серию!

# streakLow
source: 🔥 Keep going!
ru: 🔥 Так держать!

# streakMid
source: 🔥🔥 Momentum!
ru: 🔥🔥 Хороший темп!

# streakStrong
source: 🏮 Torch blazing!
ru: 🏮 Пылает как факел!

# streakHot
source: 🔥🔥🔥 Bonfire!
ru: 🔥🔥🔥 Уже костёр!

# streakRing
source: 🔥⭕ Fire ring!
ru: 🔥⭕ Огненное кольцо!

# streakLegend
source: 🎆 Legendary streak!
ru: 🎆 Легендарная серия!

source: Interface language
ru: Язык интерфейса

source: Add
ru: Добавить

source: Add language
ru: Добавить язык

# chooseLanguagesError
source: Please choose native and learning languages.
ru: Пожалуйста, выберите родной и изучаемые языки.

# chooseNativeLanguage
source: 1. Choose your native language
ru: 1. Выберите родной язык

# chooseLearningLanguages
source: 2. Choose languages to learn
ru: 2. Выберите языки для изучения

# chooseDailyWordCount
source: 3. How many words per day?
ru: 3. Сколько слов в день?

source: Get Started
ru: Начать
